<?php
/*
r 
Отвара датотеку само са могућношћу читања.  Показивач се поставља на почетак датотеке. 

r+ 
Отвара датотеку са правима и за читање и за писање. Показивач се поставља на почетак датотеке. 

w 
Отвара датотеку са правима писања.  Показивач се поставља на почетак датотеке и врши се truncate датотеке на дужину 0. Уколико датотека не постоји, покушава се њено креирање. 

w+ 
Отвара датотеку са правима писања и читања.  Показивач се поставља на почетак датотеке и врши се truncate датотеке на дужину 0. Уколико датотека не постоји, покушава се њено креирање. 

а 
Отвара датотеку само са могућношћу писања.  Показивач се поставља на крај датотеке. Уколико датотека не постоји, покушава се њено креирање. 

а+ 
Отвара датотеку са правима и за читање и за писање. Показивач се поставља на крај датотеке. Уколико датотека не постоји, покушава се њено креирање. 

х 
Креира и отвара датотеку са правима писања.  Показивач се поставља на почетак датотеке.  Уколико датотека са тим називом већ постоји, fopen() неће моћи да се изврши и вратиће false. Уколико датотека не постоји, покушава се њено креирање. 

х+ 
Креира и отвара датотеку са правима читања и писања. Остале особине су исте као за мод „х“. 

c 
Отвара датотеку за писање. Уколико датотека не постоји, врши се њено креирање. Уколико постоји, њен садржај се ни не брише, нити извршење враћа грешку. Показивач се поставља на почетак датотеке.  

c+ 
Отвара датотеку за читање и писање. Остале особине су исте као за мод „с“. 
*/

	$handle = fopen('somefile.txt', 'r');  
	fclose($handle); 
 
?>