<?php
/*
FREAD() чита из датотеке на коју показује показивач (наводи се као први аргумент) одређен број бајтова (наводи се као други аргумент)  

Функција врши читање све док се 
	 Не изврши читање од задатих n бајтова 
	 Не дође до краја датотеке (EOF) 
	 Уколико је учитан текст различит од plain текста
	 Пакет не ослободи, или догоди socket_timeout грешка 
	
fread() враћа учитан стринг, или false уколико је дошло до грешке

Функција filesize($datoteka)  враћа дужину датотеке
*/

   $filename = "002.txt"; 
   $handle = fopen($filename, "r"); 
   $contents = fread($handle, filesize($filename)); 
   fclose($handle);  

 
?>